# 
all_groups = [
    'БТМО-21', 'БТМО-22', 'БТМО-23', 'БТМО-24', 'БТМО-25', 'БТМО-26',  
    'БПИ-21', 'БПИ-22', 'БПИ-23', 'БПИ-24', 'БПИ-25', 'БПИ-26', 
    'БХТ-21', 'БХТ-22', 'БХТ-23', 'БХТ-24', 'БХТ-25', 'БХТ-26', 
    'БЭК-21', 'БЭК-22', 'БЭК-23', 'БЭК-24', 'БЭК-25', 'БЭК-26', 
    'БМТ-21', 'БМТ-22', 'БМТ-23', 'БМТ-24', 'БМТ-25', 'БМТ-26', 
    'БЭЭ-21', 'БЭЭ-22', 'БЭЭ-23', 'БЭЭ-24', 'БЭЭ-25', 'БЭЭ-26', 
    ]
current_groups = [
    'БТМО-21', 'БТМО-22', 'БТМО-23', 'БТМО-24',  
    'БПИ-21', 'БПИ-22', 'БПИ-23', 'БПИ-24',
    'БХТ-21', 'БХТ-22', 'БХТ-23', 'БХТ-24', 
    'БЭК-21', 'БЭК-22', 'БЭК-23', 'БЭК-24', 
    'БМТ-21', 'БМТ-22', 'БМТ-23', 'БМТ-24', 
    'БЭЭ-21', 'БЭЭ-22', 'БЭЭ-23', 'БЭЭ-24', 
    ]

# -----------------Приветствия-----------------
register_message = ('👋 Привет!\n\n'
                    'Пройди регистрацию и получай расписание в любое время!')
start_message = ('🤨 А я всё думал, когда же ты появишься...\n\nПривет!')

# -----------------Ошибки-----------------
error_email = ('🔴 Почта указана неверно, попробуй еще раз!')
error_group = ('🔴 Такой группы не существует, попробуй еще раз!')

# -----------------Шаги-----------------
indicate_email = ('✉️ Укажи свой E-mail адрес!')
choose_group = ('🤓 Выбери свою группу из списка!')
successful_registration = ('👍 Регистрация прошла успешно!')  